{
  "class_name": "Sequential",
  "config": {
    "name": "interactive_ai",
    "layers": [
      {
        "class_name": "Dense",
        "config": {
          "name": "input_layer",
          "units": 256,
          "activation": "relu"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "hidden_layer_1",
          "units": 128,
          "activation": "relu"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "hidden_layer_2",
          "units": 64,
          "activation": "relu"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "output_layer",
          "units": 10,
          "activation": "softmax"
        }
      }
    ]
  }
}
